In [1]:
import pandas as pd

In [8]:
df = pd.read_csv("globalAirQuality.csv")
df.head()

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017

In [22]:
df[["city","aqi"]]

           city  aqi
0      New York  108
1      New York   90
2      New York   84
3      New York  158
4      New York   97
...         ...  ...
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122
17998    Zurich   95
17999    Zurich   88

[18000 rows x 2 columns]

In [23]:
df.loc[4:7]

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
5,2025-11-04 23:25:17.554219,US,New York,40.713,-74.006,31.242,92.779,30.633,8.030,43.725,0.347,92,15.159,42.505,1.199
6,2025-11-05 00:25:17.554219,US,New York,40.713,-74.006,77.690,65.198,20.302,7.641,62.687,0.734,155,36.729,47.651,4.542
7,2025-11-05 01:25:17.554219,US,New York,40.713,-74.006,57.816,111.709,34.533,6.945,41.304,0.771,115,37.891,53.314,7.605

In [20]:
df.iloc[4:7]

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
5,2025-11-04 23:25:17.554219,US,New York,40.713,-74.006,31.242,92.779,30.633,8.030,43.725,0.347,92,15.159,42.505,1.199
6,2025-11-05 00:25:17.554219,US,New York,40.713,-74.006,77.690,65.198,20.302,7.641,62.687,0.734,155,36.729,47.651,4.542

In [21]:
df.loc[0:2,["city","aqi"]]

       city  aqi
0  New York  108
1  New York   90
2  New York   84

In [24]:
df.at[0,"city"]

'New York'

In [25]:
df.iat[0,2] # pass index of city colm

'New York'

In [33]:
# filtering of data
df[(df["aqi"]>100) & (df["temperature"]>30)]

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
6,2025-11-05 00:25:17.554219,US,New York,40.713,-74.006,77.690,65.198,20.302,7.641,62.687,0.734,155,36.729,47.651,4.542
7,2025-11-05 01:25:17.554219,US,New York,40.713,-74.006,57.816,111.709,34.533,6.945,41.304,0.771,115,37.891,53.314,7.605
14,2025-11-05 08:25:17.554219,US,New York,40.713,-74.006,38.815,121.394,25.969,4.112,44.730,1.124,121,34.481,81.790,3.576
17,2025-11-05 11:25:17.554219,US,New York,40.713,-74.006,63.552,57.838,13.754,4.427,42.251,0.997,127,36.193,62.906,7.097
25,2025-11-05 19:25:17.554219,US,New York,40.713,-74.006,56.954,75.045,29.837,9.541,54.198,1.170,113,31.289,43.279,5.264
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17947,2025-11-17 13:25:17.554219,CH,Zurich,47.377,8.542,53.938,75.183,16.255,7.263,67.244,0.457,107,32.584,81.544,7.101
17950,2025-11-17 16:25:17.554219,CH,Zurich,47.377,8.542,70.255,60.620,32.081,2.065,47.803,0.852,140,36.885,34.173,1.748
17975,2025-11-18 17:25:17.554219,CH,Zurich,47.377,8.542,33.406,98.160,44.654,0.807,45.160,0.737,111,30.761,76.073,3.570
17976,2025-11-18 18:25:17.554219,CH,Zurich,47.377,8.542,73.493,89.558,9.313,4.768,51.505,0.745,146,30.909,81.573,1.024
17991,2025-11-19 09:25:17.554219,CH,Zurich,47.377,8.542,52.120,71.160,35.405,7.752,39.811,0.878,104,32.556,31.372,2.787

In [36]:
df[(df["aqi"]>100) & (df["temperature"]>30)][["city","aqi"]]

           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

In [39]:
# query
val = 100
aqi_data = df.query("aqi > @val & temperature > 30")[["city","aqi"]].copy()
aqi_data

           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

In [40]:
# cleaning data

In [42]:
# handling missing values
df = pd.read_csv("raw_data.csv")

In [45]:
df.isnull().sum()

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [46]:
df.dropna()

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [48]:
df.dropna(axis=1) # drop col

    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10

In [49]:
df.dropna(axis=0)  # drop row

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [50]:
df.fillna(0)

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [52]:
age_mean = df["age"].mean()
df["age"].fillna(age_mean)

0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

In [55]:
cleaned_data = df.copy()
age_mean = cleaned_data["age"].mean()
cleaned_data["age"] = cleaned_data["age"].fillna(age_mean)

cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [59]:
df.duplicated()
df["country"].duplicated()
df.drop_duplicates(inplace = True)

In [60]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [71]:
# store date time
aqi_data = pd.read_csv("globalAirQuality.csv")

In [72]:
aqi_data["timestamp"] = pd.to_datetime(aqi_data["timestamp"])
aqi_data["timestamp"].dtype

dtype('<M8[ns]')

In [73]:
# Handle Strings
df["gender"] = df["gender"].str.capitalize()
df["name"].str.split(" ")

0         [John, Doe]
2       [Jane, Smith]
3              [Alex]
4     [Maria, Garcia]
5           [Li, Wei]
6                 NaN
7       [Ahmed, Khan]
8       [Rachel, Lee]
9      [Carlos, Ruiz]
10     [Emily, Davis]
Name: name, dtype: object

In [117]:
# Feature Engineering
df2 = df.copy()
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [118]:
df2["tax"] = df2["income"].apply(lambda x: "20%" if x>60000 else "10%")
df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  10%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  10%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  10%

In [120]:
gender_map = {"Male":"M", "Female":"F", "Unknown":"U"}
df2["gender"] = df2["gender"].map(gender_map)
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA    NaN  55000.0  10%
2    2    Jane Smith   NaN  Canada    NaN  62000.0  20%
3    3          Alex   NaN     USA    NaN  47000.0  10%
4    4  Maria Garcia  34.0   Spain    NaN      NaN  10%
5    5        Li Wei  27.0   China    NaN  51000.0  10%
6    6           NaN  45.0   India    NaN  73000.0  20%
7    7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%
8    8    Rachel Lee  29.0     USA    NaN  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico    NaN  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%

In [121]:
mean_age = df2["age"].median()
df2["age"] = df2["age"].fillna(mean_age)
df2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA    NaN  55000.0  10%
2    2    Jane Smith  31.0  Canada    NaN  62000.0  20%
3    3          Alex  31.0     USA    NaN  47000.0  10%
4    4  Maria Garcia  34.0   Spain    NaN      NaN  10%
5    5        Li Wei  27.0   China    NaN  51000.0  10%
6    6           NaN  45.0   India    NaN  73000.0  20%
7    7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%
8    8    Rachel Lee  29.0     USA    NaN  62000.0  20%
9    9   Carlos Ruiz  31.0  Mexico    NaN  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%

In [122]:
# assign
df2 = df2.assign(new_income = df2["income"]*1.1)
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0     USA    NaN  55000.0  10%     60500.0
2    2    Jane Smith  31.0  Canada    NaN  62000.0  20%     68200.0
3    3          Alex  31.0     USA    NaN  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain    NaN      NaN  10%         NaN
5    5        Li Wei  27.0   China    NaN  51000.0  10%     56100.0
6    6           NaN  45.0   India    NaN  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%     74800.0
8    8    Rachel Lee  29.0     USA    NaN  62000.0  20%     68200.0
9    9   Carlos Ruiz  31.0  Mexico    NaN  45000.0  10%     49500.0
10  10   Emily Davis  31.0     USA    NaN  58000.0  10%     63800.0

In [123]:
# replace
df2["country"] = df2["country"].replace("USA","US")
df2

    id          name   age country gender   income  tax  new_income
0    1      John Doe  29.0      US    NaN  55000.0  10%     60500.0
2    2    Jane Smith  31.0  Canada    NaN  62000.0  20%     68200.0
3    3          Alex  31.0      US    NaN  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain    NaN      NaN  10%         NaN
5    5        Li Wei  27.0   China    NaN  51000.0  10%     56100.0
6    6           NaN  45.0   India    NaN  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US    NaN  62000.0  20%     68200.0
9    9   Carlos Ruiz  31.0  Mexico    NaN  45000.0  10%     49500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0

In [124]:
df2.columns = ["Id","Name","Age","Country","Gender","Income","Tax","New_Income"]
df2

    Id          Name   Age Country Gender   Income  Tax  New_Income
0    1      John Doe  29.0      US    NaN  55000.0  10%     60500.0
2    2    Jane Smith  31.0  Canada    NaN  62000.0  20%     68200.0
3    3          Alex  31.0      US    NaN  47000.0  10%     51700.0
4    4  Maria Garcia  34.0   Spain    NaN      NaN  10%         NaN
5    5        Li Wei  27.0   China    NaN  51000.0  10%     56100.0
6    6           NaN  45.0   India    NaN  73000.0  20%     80300.0
7    7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%     74800.0
8    8    Rachel Lee  29.0      US    NaN  62000.0  20%     68200.0
9    9   Carlos Ruiz  31.0  Mexico    NaN  45000.0  10%     49500.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0

In [125]:
sorted_df = df2.sort_values("Income")
sorted_df.reset_index(drop=True)

   Id          Name   Age Country Gender   Income  Tax  New_Income
0   9   Carlos Ruiz  31.0  Mexico    NaN  45000.0  10%     49500.0
1   3          Alex  31.0      US    NaN  47000.0  10%     51700.0
2   5        Li Wei  27.0   China    NaN  51000.0  10%     56100.0
3   1      John Doe  29.0      US    NaN  55000.0  10%     60500.0
4  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0
5   2    Jane Smith  31.0  Canada    NaN  62000.0  20%     68200.0
6   8    Rachel Lee  29.0      US    NaN  62000.0  20%     68200.0
7   7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%     74800.0
8   6           NaN  45.0   India    NaN  73000.0  20%     80300.0
9   4  Maria Garcia  34.0   Spain    NaN      NaN  10%         NaN

In [128]:
# Ranking
sorted_df["Ranking"] = sorted_df["Income"].rank(method="max")
sorted_df

    Id          Name   Age Country Gender   Income  Tax  New_Income  Ranking
9    9   Carlos Ruiz  31.0  Mexico    NaN  45000.0  10%     49500.0      1.0
3    3          Alex  31.0      US    NaN  47000.0  10%     51700.0      2.0
5    5        Li Wei  27.0   China    NaN  51000.0  10%     56100.0      3.0
0    1      John Doe  29.0      US    NaN  55000.0  10%     60500.0      4.0
10  10   Emily Davis  31.0      US    NaN  58000.0  10%     63800.0      5.0
2    2    Jane Smith  31.0  Canada    NaN  62000.0  20%     68200.0      7.0
8    8    Rachel Lee  29.0      US    NaN  62000.0  20%     68200.0      7.0
7    7    Ahmed Khan  38.0     NaN    NaN  68000.0  20%     74800.0      8.0
6    6           NaN  45.0   India    NaN  73000.0  20%     80300.0      9.0
4    4  Maria Garcia  34.0   Spain    NaN      NaN  10%         NaN      NaN

In [133]:
df3 = df.copy()
df3["ranking"] = df3["income"].rank(method="max")
df3

    id          name   age country   gender   income  ranking
0    1      John Doe  29.0     USA     Male  55000.0      4.0
2    2    Jane Smith   NaN  Canada   Female  62000.0      7.0
3    3          Alex   NaN     USA  Unknown  47000.0      2.0
4    4  Maria Garcia  34.0   Spain   Female      NaN      NaN
5    5        Li Wei  27.0   China     Male  51000.0      3.0
6    6           NaN  45.0   India   Female  73000.0      9.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0      8.0
8    8    Rachel Lee  29.0     USA   Female  62000.0      7.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0      1.0
10  10   Emily Davis  31.0     USA      NaN  58000.0      5.0

In [135]:
df2 = df.copy()
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [136]:
# shift id colm to the end
new_col_order = [col for col in df2.columns if col!="id"] + ["id"]
print(new_col_order)

['name', 'age', 'country', 'gender', 'income', 'id']

In [137]:
df2[new_col_order]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10

In [151]:
# write to csv
df2 = df.copy()
df2 = df2.drop_duplicates()
df2 = df2.fillna(0)
df2 = df2.sort_values("income")
df2 = df2.reset_index(drop=True)
df2.to_csv("sorted_data.csv")
df2

   id          name   age country   gender   income
0   4  Maria Garcia  34.0   Spain   Female      0.0
1   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
2   3          Alex   0.0     USA  Unknown  47000.0
3   5        Li Wei  27.0   China     Male  51000.0
4   1      John Doe  29.0     USA     Male  55000.0
5  10   Emily Davis  31.0     USA        0  58000.0
6   2    Jane Smith   0.0  Canada   Female  62000.0
7   8    Rachel Lee  29.0     USA   Female  62000.0
8   7    Ahmed Khan  38.0       0     Male  68000.0
9   6             0  45.0   India   Female  73000.0

In [152]:
df2.groupby("country")["income"].sum() # country wise income da sum

country
0          68000.0
Canada     62000.0
China      51000.0
India      73000.0
Mexico     45000.0
Spain          0.0
USA       222000.0
Name: income, dtype: float64

In [153]:
df2.groupby("country")["income"].mean()

country
0         68000.0
Canada    62000.0
China     51000.0
India     73000.0
Mexico    45000.0
Spain         0.0
USA       55500.0
Name: income, dtype: float64

In [155]:
df2.groupby("country")["income"].agg(["mean","min","sum"])

            mean      min       sum
country
0        68000.0  68000.0   68000.0
Canada   62000.0  62000.0   62000.0
China    51000.0  51000.0   51000.0
India    73000.0  73000.0   73000.0
Mexico   45000.0  45000.0   45000.0
Spain        0.0      0.0       0.0
USA      55500.0  47000.0  222000.0

In [158]:
# labels
df2.groupby("country")["income"].agg(avg_sal = "mean",min_sal = "min",sum = "sum")

         avg_sal  min_sal       sum
country
0        68000.0  68000.0   68000.0
Canada   62000.0  62000.0   62000.0
China    51000.0  51000.0   51000.0
India    73000.0  73000.0   73000.0
Mexico   45000.0  45000.0   45000.0
Spain        0.0      0.0       0.0
USA      55500.0  47000.0  222000.0

In [159]:
df2.groupby("country").agg({
    "income": "mean",
    "age" : "mean"
})

          income    age
country
0        68000.0  38.00
Canada   62000.0   0.00
China    51000.0  27.00
India    73000.0  45.00
Mexico   45000.0   0.00
Spain        0.0  34.00
USA      55500.0  22.25

In [162]:
# change labels
df.groupby("country").agg(
    max_sal = ("income", "max"),
    avg_sal = ("income","mean")
)

         max_sal  avg_sal
country
Canada   62000.0  62000.0
China    51000.0  51000.0
India    73000.0  73000.0
Mexico   45000.0  45000.0
Spain        NaN      NaN
USA      62000.0  55500.0

In [163]:
# Melt and Pivot

In [165]:
# Merging and Joining data
df_customer = pd.DataFrame({
    "customer_id" : [1,2,3,4],
    "name" : ["Adam","Bob","Charlie","Dave"]
})

df_orders = pd.DataFrame({
    "order_id" : [101,102,103,104],
    "customer_id" : [2,1,4,5],
    "amount": [250,120,300,180]
})

In [169]:
print(df_customer)
print(df_orders)

   customer_id     name
0            1     Adam
1            2      Bob
2            3  Charlie
3            4     Dave
   order_id  customer_id  amount
0       101            2     250
1       102            1     120
2       103            4     300
3       104            5     180

In [167]:
pd.merge(df_customer,df_orders, on="customer_id")

   customer_id  name  order_id  amount
0            1  Adam       102     120
1            2   Bob       101     250
2            4  Dave       103     300

In [170]:
pd.merge(df_customer,df_orders, on="customer_id", how="left")

   customer_id     name  order_id  amount
0            1     Adam     102.0   120.0
1            2      Bob     101.0   250.0
2            3  Charlie       NaN     NaN
3            4     Dave     103.0   300.0